<script lang="ts">

    import { onMount } from 'svelte';
    import {createSmartappDebugger, createAssistant} from '@sberdevices/assistant-client';
    import { setTheme } from './themes';
    import { logger } from "./utils";
    import Help from './Help.svelte';

    const dictionary = [
        'Абрикос',
        'Абсцисса',
        'Аварийка',
        'Авиабаза',
        'Авиабилет',
        'Авиазавод',
        'Авиакомпания',
        'Авианосец',
        'Авиапассажир',
        'Авиасалон',
        'Авиатранспорт',
        'Авокадо',
        'Австралопитек',
        'Авто',
        'Автовокзал',
        'Автограф',
        'Автодорога',
        'Автодром',
        'Автокран',
        'Автомагистраль',
        'Автоответчик',
        'Автопарк',
        'Автоцистерна',
        'Агент',
        'Агротехник',
        'Адъютант',
        'Азбука',
        'Азбука',
        'Азия',
        'Аист',
        'Айсберг',
        'Академик',
        'Аквалангист',
        'Аквапарк',
        'Аквапарк',
        'Акварель',
        'Аккумулятор',
        'Актёр',
        'Акула',
        'Акцент',
        'Акция',
        'Алгоритм',
        'Алкоголь',
        'Аллея',
        'Аллигатор',
        'Алтарь',
        'Альбом',
        'Алюминий',
        'Амазонка',
        'Амбал',
        'Амбар',
        'Аминокислота',
        'Амфитеатр',
        'Анаконда',
        'Ангар',
        'Ангел',
        'Анекдот',
        'Анестезия.',
        'Антилопа',
        'Античность',
        'Аппарат',
        'Аптека',
        'Аптекарша',
        'Арбалетчик',
        'Арфа',
        'Архангел',
        'Аскорбинка',
        'Ассистент',
        'Астероид',
        'Астролог',
        'Асфальт',
        'Атлантида',
        'Атмосфера',
        'Афиша',
        'Аэродром',
        'Бабочка',
        'Бадья',
        'База',
        'Байкал',
        'Бактерия',
        'Балаган',
        'Балет',
        'Балкон',
        'Бампер',
        'Бандит',
        'Банка',
        'Банкнота',
        'Баня',
        'Барc',
        'Барак',
        'Баран',
        'Барахло',
        'Баржа',
        'Бармен',
        'Барселона',
        'Барсук',
        'Барыня',
        'Бат',
        'Башмак',
        'Баян',
        'Баянист',
        'Бездна',
        'Безумие',
        'Белка',
        'Бельгиец',
        'Бельгия',
        'Берлин',
        'Беседа',
        'Бестселлер',
        'Бетономешалка',
        'Бидон',
        'Билет',
        'Бильярд',
        'Бинокль',
        'Бинт',
        'Биосфера',
        'Биржа',
        'Бирка',
        'Блоха',
        'Блузка',
        'Боб',
        'Бобр',
        'Бог',
        'Боинг',
        'Бокал',
        'Болельщик',
        'Болото',
        'Болт',
        'Борец',
        'Бородавка',
        'Борщ',
        'Ботинок',
        'Боцман',
        'Бра',
        'Бразилия',
        'Брат',
        'Бревно',
        'Брезент',
        'Бритва',
        'Брод',
        'Брокер',
        'Броненосец',
        'Бронепоезд',
        'Броня',
        'Брошка',
        'Брошюра',
        'Бубен',
        'Будильник',
        'Буйвол',
        'Буйство',
        'Буква',
        'Букварь',
        'Буковка',
        'Булыжник',
        'Бумажник',
        'Бунт',
        'Бутерброд',
        'Бушлат',
        'Бюллетень',
        'Бюрократия',
        'Вагон',
        'Вазелин',
        'Вазелин',
        'Валюта',
        'Вантуз',
        'Варенье',
        'Вата',
        'Ватник',
        'Ватник',
        'Ваучер',
        'Вдова',
        'Ведомость',
        'Ведомство',
        'Велосипед',
        'Венгрия',
        'Венесуэла',
        'Венесуэла',
        'Венец',
        'Вентиль',
        'Вентиляция',
        'Вертолет',
        'Ветеринар',
        'Вешалка',
        'Взаимодействие',
        'Взяточник',
        'Видео',
        'Видеокассета',
        'Виза',
        'Вино',
        'Виноград',
        'Виолончель',
        'Виртуоз',
        'Витамин',
        'Витрина',
        'Вихрь',
        'Влага',
        'Влажность',
        'Вмятина',
        'Внедорожник',
        'Вода',
        'Водитель',
        'Водоем',
        'Водопровод',
        'Воевода',
        'Вождь',
        'Возмездие',
        'Волк',
        'Волонтёр',
        'Воробей',
        'Воровка',
        'Воск',
        'Врата',
        'Вратарь',
        'Врач',
        'Вспышка',
        'Вуз',
        'Выдра',
        'Выключатель',
        'Выключатель',
        'Вымя',
        'Выпускник',
        'Выражение',
        'Вырез',
        'Высказывание',
        'Вьетнам',
        'Вязание',
        'Гадалка',
        'Гадюка',
        'Газета',
        'Гайка',
        'Галактика',
        'Гараж',
        'Гарантия',
        'Гарем',
        'Гарнир',
        'Гарпун',
        'Гвоздь',
        'Гениальность',
        'Герань',
        'Гербарий',
        'Гильотина',
        'Гимназист',
        'Гиппопотам',
        'Гитара',
        'Глава',
        'Гладиолус',
        'Глаз',
        'Глубина',
        'Глушитель',
        'Гном',
        'Голливуд',
        'Голубь',
        'Гонг',
        'Горб',
        'Горловина',
        'Гороскоп',
        'Горох',
        'Горшок',
        'Гравюра',
        'Град',
        'Граммофон',
        'Гранат',
        'Гречка',
        'Гробница',
        'Гроза',
        'Губа',
        'Губернатор',
        'Гусеница',
        'Гусь',
        'Давление',
        'Дайвинг',
        'Дальтоник',
        'Двигатель',
        'Дезодорант',
        'Декорация',
        'Дельфин',
        'Демократ',
        'Деньги',
        'Депо',
        'Десант',
        'Дефект',
        'Дефект',
        'Джин',
        'Дизайнер',
        'Диктатор',
        'Диктатор',
        'Дирижер',
        'Диспетчер',
        'Дисплей',
        'Дисциплина',
        'Дно',
        'Добавка',
        'Дозатор',
        'Дозор',
        'Долголетие',
        'Домкрат',
        'Дочерь',
        'Драгоценность',
        'Дракон',
        'Древесина',
        'Дрессировщик',
        'Дробь',
        'Дрова',
        'Дубина',
        'Дубленка',
        'Дубликат',
        'Дудка',
        'Дух',
        'Дуэт',
        'Дымоход',
        'Дыра',
        'Дыхание',
        'Дятел',
        'Евразия',
        'Египет',
        'Еда',
        'Ёж',
        'Ежевика',
        'Енот',
        'Жаба',
        'Жаворонок',
        'Жакет',
        'Жало',
        'Жар',
        'Жезл',
        'Желе',
        'Желток',
        'Жемчуг',
        'Женщина',
        'Живот',
        'Жидкость',
        'Жираф',
        'Жук',
        'Жук',
        'Журналист',
        'Загадка',
        'Зазор',
        'Закат',
        'Закон',
        'Законодатель',
        'Замок',
        'Заноза',
        'Запах',
        'Заплыв',
        'Заповедник',
        'Зарплата',
        'Заря',
        'Зарядка',
        'Затишье',
        'Заяц',
        'Звон',
        'Звонарь',
        'Зебра',
        'Зелье',
        'Землянин',
        'Зеркало',
        'Зерно',
        'Зернышко',
        'Змея',
        'Знак',
        'Знамя',
        'Значок',
        'Зонт',
        'Игрок',
        'Изба',
        'Извилина',
        'Издательство',
        'Изобретатель',
        'Изюм',
        'Икона',
        'Икра',
        'Инвентарь',
        'Индикатор',
        'Индия',
        'Индонезия',
        'Индюк',
        'Иней',
        'Инжир',
        'Инопланетянин',
        'Интернет',
        'Интерьер',
        'Инфекция',
        'Ириска',
        'Искусствовед',
        'Использование',
        'Исследование',
        'Йога',
        'Кабан',
        'Кабан',
        'Кабанчик',
        'Кабачок',
        'Кабинет',
        'Кабинетик',
        'Каблук',
        'Кавалер',
        'Казан',
        'Калейдоскоп',
        'Калоша',
        'Камбала',
        'Камбоджа',
        'Каменоломня',
        'Каменщик',
        'Камера',
        'Камин',
        'Камыш',
        'Канарейка',
        'Канатоходец',
        'Канистра',
        'Канун',
        'Капелька',
        'Капитал',
        'Капитан',
        'Капля',
        'Капот',
        'Капсула',
        'Капустник',
        'Капюшон',
        'Карабин',
        'Караван',
        'Карандаш',
        'Карась',
        'Караул',
        'Каркас',
        'Карта',
        'Картежник',
        'Картечь',
        'Картофелина',
        'Касса',
        'Кассета',
        'Кастет',
        'Катапульта',
        'Категория',
        'Катерок',
        'Кафтан',
        'Качели',
        'Квадрат',
        'Квант',
        'Квас',
        'Квитанция',
        'Кетчуп',
        'Кибернетик',
        'Кий',
        'Кикимора',
        'Кинжал',
        'Кино',
        'Киноактер',
        'Кинозвезда',
        'Кинопленка',
        'Киностудия',
        'Кипр',
        'Кирка',
        'Кислота',
        'Кисточка',
        'Кит',
        'Кладоискатель',
        'Клапан',
        'Клерк',
        'Клетка',
        'Клетушка',
        'Клешня',
        'Клещ',
        'Клоп',
        'Клоун',
        'Клубника',
        'Клубок',
        'Клумба',
        'Клюв',
        'Ключица',
        'Клюшка',
        'Кляп',
        'Книжка',
        'Княжна',
        'Кобель',
        'Кобра',
        'Коготь',
        'Кодекс',
        'Кожа',
        'Кок',
        'Колготки',
        'Колдун',
        'Колибри',
        'Колобок',
        'Колодец',
        'Колхоз',
        'Колхозник',
        'Колышек',
        'Кольцо',
        'Коляска',
        'Команда',
        'Командир',
        'Комбайн',
        'Коммуникация',
        'Комната',
        'Комод',
        'Компания',
        'Композитор',
        'Конверт',
        'Конвой',
        'Конёк',
        'Конечность',
        'Конница',
        'Конспект',
        'Консул',
        'Контейнер',
        'Контекст',
        'Континент',
        'Контрабанда',
        'Контракт',
        'Конфетка',
        'Конфеты',
        'Конюшня',
        'Копеечка',
        'Копыто',
        'Копье',
        'Кордон',
        'Корея',
        'Корова',
        'Коровка',
        'Коровник',
        'Королева',
        'Король',
        'Коромысло',
        'Коромысло',
        'Корона',
        'Корона',
        'Коса',
        'Косметика',
        'Космонавт',
        'Костер',
        'Костяк',
        'Котелок',
        'Кофе',
        'Кофеварка',
        'Кофеин',
        'Кофейник',
        'Кофейня',
        'Кофта',
        'Кочевник',
        'Кочегарка',
        'Кочерга',
        'Кочерыжка',
        'Кошечка',
        'Кошка',
        'Краб',
        'Кран',
        'Креветка',
        'Крематорий',
        'Кремень',
        'Крепость',
        'Кровоток',
        'Кровь',
        'Кроль',
        'Кроссворд',
        'Кроссворд',
        'Крот',
        'Круг',
        'Кругозор',
        'Кружечка',
        'Кружка',
        'Круиз',
        'Крыло',
        'Крыльцо',
        'Крышечка',
        'Крышка',
        'Кувшин',
        'Кувшинка',
        'Кувшинка',
        'Кузов',
        'Куколка',
        'Кукушка',
        'Кулиса',
        'Куница',
        'Куртка',
        'Курятина',
        'Кухонька',
        'Лайка',
        'Лайнер',
        'Лапка',
        'Лапочка',
        'Лапша',
        'Лауреат',
        'Лебедь',
        'Лев',
        'Лейка',
        'Лемур',
        'Ленивец',
        'Ленточка',
        'Ленточка',
        'Леопард',
        'Лес',
        'Лесопилка',
        'Лесопункт',
        'Леший',
        'Лисица',
        'Лиска',
        'Лист',
        'Лишай',
        'Ловушка',
        'Лодка',
        'Лодочник',
        'Локоть',
        'Лом',
        'Ломбард',
        'Ломик',
        'Лосось',
        'Лось',
        'Лось',
        'Лотерея',
        'Лошадь',
        'Луковица',
        'Львица',
        'Львица',
        'Люк',
        'Лягушка',
        'Мавзолей',
        'Магистраль',
        'Магнат',
        'Магнитофон',
        'Майонез',
        'Макет',
        'Малыш',
        'Мальчик',
        'Манёвр',
        'Манекен',
        'Маникюр',
        'Маникюр',
        'Мантия',
        'Манто',
        'Манто',
        'Маргарин',
        'Марево',
        'Мародер',
        'Мародер',
        'Мартышка',
        'Маршрутка',
        'Маска',
        'Маслина',
        'Маслозавод',
        'Массажист',
        'Мастер',
        'Математика',
        'Матрёшка',
        'Матрица',
        'Машиностроение',
        'Маятник',
        'Маятник',
        'Медалист',
        'Медведь',
        'Медпункт',
        'Медуза',
        'Менеджер',
        'Металл',
        'Метелка',
        'Мешок',
        'Мидии',
        'Мидия',
        'Микроклимат',
        'Микроскоп',
        'Микрофон',
        'Микстура',
        'Миндаль',
        'Митинг',
        'Митрополит',
        'Множитель',
        'Могила',
        'Мозжечок',
        'Молекула',
        'Моллюск',
        'Молния',
        'Моль',
        'Монастырь',
        'Монитор',
        'Монитор',
        'Монтировка',
        'Морковь',
        'Морковь',
        'Мороженое',
        'Мороз',
        'Морская',
        'Морской',
        'Мотор',
        'Мотоцикл',
        'Мох',
        'Мочалка',
        'Музей',
        'Мука',
        'Мундир',
        'Мундштук',
        'Муравей',
        'Муравейник',
        'Мускулатура',
        'Мусор',
        'Муха',
        'Мушкетёр',
        'Мыло',
        'Мыльница',
        'Мышеловка',
        'Мышь',
        'Мясо',
        'Мясорубка',
        'Мята',
        'Навес',
        'Навозный',
        'Наволочка',
        'Надзиратель',
        'Накипь',
        'Наклейка',
        'Наковальня',
        'Напильник',
        'Наполеон',
        'Наркоман',
        'Наследственность',
        'Насморк',
        'Наушник',
        'Наушник',
        'Неведение',
        'Неведение',
        'Невежество',
        'Невезение',
        'Невнимательность',
        'Недочёт',
        'Незнайка',
        'Неразбериха',
        'Нерв',
        'Нервотрепка',
        'Неряшливость',
        'Нимфа',
        'Нога',
        'Ножка',
        'Ноосфера',
        'Норвегия',
        'Нос',
        'Ночлег',
        'Няня',
        'Обед',
        'Обезьяна',
        'Облава',
        'Ободок',
        'Обои',
        'Обруч',
        'Обсерватория',
        'Объединение',
        'Объявление',
        'Овощерезка',
        'Овца',
        'Овчарка',
        'Огород',
        'Огурец',
        'Одуванчик',
        'Ожерелье',
        'Озеро',
        'Оксид',
        'Окуляр',
        'Окунь',
        'Олень',
        'Олимпиада',
        'Опера',
        'Оператор',
        'Описание',
        'Оплата',
        'Оправдание',
        'Опрятность',
        'Опыт',
        'Организм',
        'Орден',
        'Орех',
        'Орешник',
        'Оригами',
        'Орнитолог',
        'Оса',
        'Осёл',
        'Осколок',
        'Основатель',
        'Особняк',
        'Остров',
        'Осьминог',
        'Отель',
        'Отец',
        'Ошейник',
        'Палата',
        'Палец',
        'Палка',
        'Панацея',
        'Панда',
        'Панель',
        'Пансион',
        'Панцирь',
        'Папка',
        'Параграф',
        'Параллелограмм',
        'Параноик',
        'Пароварка',
        'Пароль',
        'Парусник',
        'Паспорт',
        'Паспорт',
        'Пастух',
        'Пасть',
        'Патефон',
        'Паук',
        'Педаль',
        'Пеленка',
        'Пельмени',
        'Пентаграмма',
        'Передвижение',
        'Перекись',
        'Перекладина',
        'Перекрёсток',
        'Перепонка',
        'Перрон',
        'Персона',
        'Перхоть',
        'Песок',
        'Петелька',
        'Петух',
        'Печень',
        'Печенье',
        'Печь',
        'Пешка',
        'Пиво',
        'Пиратство',
        'Пирс',
        'Пиршество',
        'Писательство',
        'Письмо',
        'Питание',
        'Питомец',
        'Плакат',
        'Планшет',
        'Пластелин',
        'Пластик',
        'Пластырь',
        'Пластырь',
        'Платье',
        'Платье',
        'Плед',
        'Плесень',
        'Плод',
        'Плоскостопие',
        'Плотина',
        'Плуг',
        'Побег',
        'Поводок',
        'Погремушка',
        'Подделка',
        'Подпись',
        'Подушка',
        'Подшивка',
        'Подъезд',
        'Пожарный',
        'Покрывало',
        'Полено',
        'Политолог',
        'Полка',
        'Полтинник',
        'Полюс',
        'Помилование',
        'Попугай',
        'Порог',
        'Порошок',
        'Порт',
        'Портрет',
        'Портфель',
        'Поручень',
        'Поселок',
        'Посылка',
        'Посылка',
        'Походка',
        'Почта',
        'Преимущество',
        'Приветствие',
        'Привычка',
        'Признание',
        'Приклад',
        'Приключение',
        'Примат',
        'Принтер',
        'Продавщица.',
        'Продюсер',
        'Проектировщик',
        'Прозрение',
        'Пропуск',
        'Просмотр Сериалов',
        'Простота',
        'Просьба',
        'Противогаз',
        'Профессор',
        'Процессор',
        'Прочтение',
        'Прощение',
        'Прут',
        'Прялка',
        'Птенец',
        'Птица',
        'Пудра',
        'Пузырь',
        'Пулемёт',
        'Пульс',
        'Пульт',
        'Путник',
        'Пчела',
        'Пшеница',
        'Пшено',
        'Пыль',
        'Пятно',
        'Работница',
        'Равнина',
        'Радиоэлектроника',
        'Радуга',
        'Разгром',
        'Разделение',
        'Различие',
        'Размычка',
        'Райская',
        'Ракетчик',
        'Рама',
        'Рана',
        'Раствор',
        'Растение',
        'Растяпа',
        'Расширитель',
        'Ратуша',
        'Реакция',
        'Режиссер',
        'Резиденция',
        'Резина',
        'Резинка',
        'Резинка',
        'Решение',
        'Рисование',
        'Роза',
        'Розетка',
        'Ролики',
        'Ромашка',
        'Ромб',
        'Рот',
        'Ружье',
        'Рукавица',
        'Рукопись',
        'Русалка',
        'Ручей',
        'Ручей',
        'Рыба',
        'Рюкзак',
        'Сабля',
        'Садовод',
        'Салат',
        'Салют',
        'Самовнушение',
        'Самодеятельность',
        'Самозванец',
        'Самоконтроль',
        'Самопроизвольность',
        'Самурай',
        'Сангвиник',
        'Сани',
        'Санитария',
        'Санки',
        'Сантехник',
        'Сапфир',
        'Саранча',
        'Сахар',
        'Свадьба',
        'Сварщик',
        'Свёкла',
        'Светильник',
        'Светотехник',
        'Светотехника',
        'Светофор',
        'Светофор',
        'Свинец',
        'Свинка',
        'Сектор',
        'Секция',
        'Село',
        'Сёмга',
        'Семя',
        'Сервер',
        'Сиденье',
        'Синица',
        'Сияние',
        'Скалка',
        'Сканворд',
        'Скандалист',
        'Скважина',
        'Скептицизм',
        'Складка',
        'Сковородка',
        'Скорбь',
        'Скрипка',
        'Скряга',
        'Скунс',
        'Слеза',
        'Слеза',
        'Слон',
        'Слуга',
        'Служитель',
        'Смерч',
        'Снегирь',
        'Собака',
        'Сова',
        'Сожительство',
        'Созвучие',
        'Сок',
        'Сокол',
        'Солист',
        'Соловей',
        'Соль',
        'Сом',
        'Соприкосновение',
        'Сорока',
        'Сосед',
        'Сосулька',
        'Соты',
        'Соцветие',
        'Сочинительство',
        'Спальня',
        'Спирт',
        'Спорт',
        'Спортзал',
        'Справочник',
        'Спринтер',
        'Сруб',
        'Ссадина',
        'Стамбул',
        'Стан',
        'Старец',
        'Старшинство',
        'Стая',
        'Створка',
        'Стелька',
        'Стоп-Кран',
        'Страдалец',
        'Страница',
        'Страус',
        'Стрекоза',
        'Строка',
        'Стружка',
        'Студия',
        'Судоходство',
        'Судьба',
        'Сурок',
        'Суслик',
        'Суши',
        'Сфера',
        'Табак',
        'Таблица',
        'Таганок',
        'Таиланд',
        'Тайник',
        'Танец',
        'Танк',
        'Танцор',
        'Таракан',
        'Тарелка',
        'Творение',
        'Театр',
        'Тележка',
        'Телеобъектив',
        'Телефон',
        'Телец',
        'Теплопровод',
        'Термометр',
        'Тетрадь',
        'Тигр',
        'Ткань',
        'Токарь',
        'Торт',
        'Травма',
        'Трактат',
        'Трибуна',
        'Трилистник',
        'Тромб',
        'Трон',
        'Тропа',
        'Трос',
        'Труба',
        'Туберкулёз',
        'Тулуп',
        'Турист',
        'Туфля',
        'Тыква',
        'Тюлень',
        'Тюльпан',
        'Тяжесть',
        'Убежище',
        'Уборщица',
        'Убыль',
        'Уведомление',
        'Увеличение',
        'Уголовник',
        'Угорь',
        'Удав',
        'Ударник',
        'Удостоверение',
        'Удочка',
        'Удочка',
        'Уж',
        'Ужин',
        'Узкость',
        'Укроп',
        'Улитка',
        'Улучшение',
        'Умывальник',
        'Уникальность',
        'Упаковка',
        'Управляющий',
        'Упущение',
        'Уран',
        'Усадьба',
        'Успешность',
        'Усталость',
        'Устройство',
        'Утконос.',
        'Утюг',
        'Учебник',
        'Ученый',
        'Учитель',
        'Файл',
        'Фараон',
        'Фараон',
        'Фельдшер',
        'Феникс',
        'Фермер',
        'Физиономия',
        'Филе',
        'Филин',
        'Филология',
        'Фильтр',
        'Финик',
        'Фишка',
        'Флэшка',
        'Фляга',
        'Фонарь',
        'Фондю',
        'Форель',
        'Фортепьяно',
        'Форточка',
        'Фотоаппарат',
        'Фотография',
        'Фрукт',
        'Фруктоза',
        'Халат',
        'Халва',
        'Хамство',
        'Хворост',
        'Хворост',
        'Хвост',
        'Хвоя',
        'Хлев',
        'Хлопотун',
        'Хлопья',
        'Хмель',
        'Хобби',
        'Хобот',
        'Хоккей',
        'Холст',
        'Хомяк',
        'Хор',
        'Хот-Дог',
        'Хранитель',
        'Художество',
        'Хулиганьё',
        'Хутор',
        'Царь',
        'Циновка',
        'Цитология',
        'Чай',
        'Чайник',
        'Частица',
        'Чемодан',
        'Чемпион',
        'Чердак',
        'Чердак',
        'Черепаха',
        'Черника',
        'Чулан',
        'Чума',
        'Шагомер',
        'Шалун',
        'Шампунь',
        'Шампунь',
        'Шахматы',
        'Шашки',
        'Швабра',
        'Шеф',
        'Шиповник',
        'Ширинка',
        'Шишка',
        'Шкаф',
        'Шланг',
        'Шлюз',
        'Шлюпка',
        'Шматок',
        'Шнурок',
        'Шорты',
        'Шоссе',
        'Шофер',
        'Шприц',
        'Шпроты',
        'Шрифт',
        'Штамп',
        'Штанга',
        'Штиблеты',
        'Штука',
        'Щеколда',
        'Щетка',
        'Щипчики',
        'Щука',
        'Эколог',
        'Экология',
        'Экран',
        'Элеватор',
        'Электрик',
        'Эссенция',
        'Эхолот',
        'Яблоня',
        'Ягуар',
        'Ястребёнок'
    ];
    const dictionary2 = [
        'Акведук',
        'Акушер',
        'Акушерство',
        'Альманах',
        'Анкер',
        'Аорта',
        'Аперитив',
        'Аритмия',
        'Арматура',
        'Артерия',
        'Атрибут',
        'Бадья',
        'Баклан',
        'Бандероль',
        'Барбос',
        'Барометр',
        'Басурманин',
        'Беженец',
        'Белладонна',
        'Бордель',
        'Будапешт',
        'Бухарест',
        'Варшава',
        'Веретено',
        'Владивосток',
        'Возница',
        'Войлок',
        'Вундеркинд',
        'Выделка',
        'Выемка',
        'Вырубка',
        'Галоша',
        'Гималаи ',
        'Гинеколог ',
        'Графин',
        'Грунт',
        'Грунтовка',
        'Декан',
        'Деструктивность',
        'Джедай',
        'Джин',
        'Дума',
        'Дьякон',
        'Ехидна',
        'Жандарм',
        'Жасмин',
        'Женьшень',
        'Жилплощадь',
        'Жнец',
        'Завещание',
        'Задворки',
        'Залог',
        'Зевака',
        'Зола',
        'Зразы',
        'Иллюминация',
        'Иммигрант',
        'Инструкция',
        'Инсулин',
        'Интернат',
        'Интернатура',
        'Кабак',
        'Кадиллак',
        'Кадило',
        'Казнокрадство',
        'Канделябр ',
        'Капилляр',
        'Карикатурист',
        'Карма',
        'Катод',
        'Каучук',
        'Качалка',
        'Керосин',
        'Керчь',
        'Киловатт',
        'Киль',
        'Кимоно',
        'Китель',
        'Клизма',
        'Козерог',
        'Комбайн',
        'Комендатура',
        'Копоть',
        'Корма',
        'Коррозия',
        'Корсет',
        'Кортеж',
        'Косилка',
        'Крепостной',
        'Кружево',
        'Ксерокс',
        'Купальник',
        'Купорос',
        'Курск',
        'Лакей',
        'Лама',
        'Ландыш',
        'Лоскут',
        'Лосьон',
        ' Манеж',
        'Марс',
        'Монашка',
        'Мякиш ',
        'Навес',
        'Навоз',
        'Намордник',
        'Нахал',
        'Небывальщина',
        'Нил',
        'Облицовка',
        'Оракул',
        'Оранжерея',
        'Откровенность',
        'Отрава',
        'Палеозой',
        'Папоротник',
        'Параболоид ',
        'Патефон',
        'Перила',
        'Перина',
        'Петербург',
        'Пион',
        'Подлежащее',
        'Последовательность',
        'Поставка',
        'Постмодернизм',
        'Предел ',
        'Предсердие',
        'Презумпция',
        'Протеже',
        'Прохвост',
        'Пуританин ',
        'Ребро',
        'Реновация',
        'Рифмоплёт',
        'Робототехника',
        '«Оливье»',
        'Салями',
        'Симуляция',
        'Скальпель',
        'Слизняк',
        'Слизь',
        'Спиннинг',
        'Спирт',
        'Стыковка',
        'Сыроделие',
        'Твистер',
        'Телец',
        'Том Ям',
        'Трансплантация',
        'Турбулентность',
        'Тюфяк',
        'Фальсификация',
        'Фальшивомонетчик',
        'Хинкали',
        'Чихуахуа',
        'Чужеземец',
        'Чужестранец',
        'Шиншилла',
        'Шитье',
        'Шифер',
        'Шовинизм',
        'Штырь',
        'Шуруп',
        'Электролиз',
        'Энциклопедист',
        'Юар',
        '',
        'Суффикс',
        'Одутловатость',
        'Автобиографичность',
        'Неокончательность',
        'Колориметр',
        'Решение',
        'Тройня',
        'Предугадывание',
        'Сутулость',
        'Утильсырьё',
        'Контрабандистка',
        'Австралиец',
        'Просверливание',
        'Неблагополучие',
        'Пресс-Центр',
        'Всадник',
        'Этюдист',
        'Безынициативность',
        'Обессмысливание',
        'Аул',
        'Щиколотка',
        'Хирургия',
        'Рекордист',
        'Несущественность',
        'Предречение',
        'Братоубийство',
        'Фанера',
        'Диабет',
        'Грешница',
        'Инсулин',
        'Сахаронос',
        'Софа',
        'Авангардист',
        'Устав',
        'Самоощущение',
        'Восхищение',
        'Френд-Зона',
        'Поездка',
        'Теплоизоляция',
        'Яблоня',
        'Партизанка',
        'Сборщица',
        'Электростатика',
        'Инсульт',
        'Штрафование',
        'Суперарбитр',
        'Инструментарий',
        'Основательница',
        'Именинник',
        'Пуло',
        'Библиотековед',
        'Подвиливание',
        'Багет',
        'Колумбийка',
        'Санитария',
        'Дикарство',
        'Терморегулятор',
        'Отрыжка',
        'Хлеботорговец',
        'Волокнистость',
        'Бесхарактерность',
        'Канцлер',
        'Волнистость',
        'Жилплощадь',
        'Римлянка',
        'Липкость',
        'Доход',
        'Очевидец',
        'Геодезия',
        'Жертвование',
        'Квас',
        'Уроженец',
        'Арест',
        'Плод',
        'Лондон',
        'Парафин',
        'Чулан',
        'Париж',
        'Фломастер',
        'Кинозвезда',
        'Блюдо',
        'Акционер',
        'Горшок',
        'Волокно',
        'Абак',
        'Тайна',
        'Площадь',
        'Перо',
        'Италия',
        'Кроль',
        'Бланк',
        'Каучук',
        'Бюллетень',
        'Тапочки',
        'Комар',
        'Видеомагнитофон',
        'Перископ',
        'Кувшинка',
        'Сковородка',
        'Реквизит',
        'Корзина',
        'Канат',
        'Архангел',
        'Пехота',
        'Ателье',
        'Колготки',
        'Хмель',
        'Кирпич',
        'Бегемот',
        'Залог',
        'Камаз',
        'Гиппопотам',
        'Гладиолус',
        'Конфорка',
        'Сани',
        'Волейбол',
        'Каракуль',
        'Гора',
        'Полено',
        'Апартамент',
        'Кинопленка',
        'Валидол',
        'Катар',
        'Королевство',
        'Ядро',
        'Княжество',
        'Палестина',
        'Плитка',
        'Венок',
        'Шоколад',
        'Пятно',
        'Медь',
        'Трамвай',
        'Кобура',
        'Лыжа',
        'Клавиатура',
        'Линолеум',
        'Нимфа',
        'Обед',
        'Вентиль',
        'Колесо',
        'Батальон',
        'Плечо',
        'Жертва',
        'Повидло',
        'Значок',
        'Подарок',
        'Динамик',
        'Бабка',
        'Винегрет',
        'Мышка',
        'Монета',
        'Песок',
        'Лямка',
        'Космонавт',
        'Зола',
        'Молот',
        'Сарай',
        'Этажерка',
        'Свитер',
        'Баскетболист',
        'Кукла',
        'Замша',
        'Десна',
        'Дьякон',
        'Скамейка',
        'Бивень',
        'Кабель',
        'Орган',
        'Бездна',
        'Иллюзия',
        'Секция',
        'Гардероб',
        'Улей',
        'Кавалерист',
        'Шмель',
        'Факс',
        'Лампочка',
        'Архитектор',
        'Айсберг',
        'Театр',
        'Бастион',
        'Каталог',
        'Купорос',
        'Монитор',
        'Перстень',
        'Библиотекарша',
        'Удав',
        'Одеколон',
        'Амфибия',
        'Бык',
        'Владивосток',
        'Кибернетик',
        'Ведомство',
        'Санки',
        'Кит',
        'Ворон',
        'Бадья',
        'Консул',
        'Портрет',
        'Коробок',
        'Кулек',
        'Крепость',
        'Водопад',
        'Базар',
        'Душ',
        'Калькулятор',
        'Венгр',
        'Пузырь',
        'Желудь',
        'Заколка',
        'Голень',
        'Алмаз',
        'Кувалда',
        'Автовокзал',
        'Алхимик',
        'Аверс',
        'Пудель',
        'Священник',
        'Канва',
        'Кроватка',
        'Перекись',
        'Бабушка',
        'Флейта',
        'Накипь',
        'Фараон',
        'Слиток',
        'Бифштекс',
        'Аксельбант',
        'Изверг',
        'Трюм',
        'Азия',
        'Наволочка',
        'Дубленка',
        'Джин',
        'Агат',
        'Машина',
        'Кучер',
        'Медуза',
        'Глушитель',
        'Ужин',
        'Гармошка',
        'Кассета',
        'Композитор',
        'Гром',
        'Наливка',
        'Землянка',
        'Лесник',
        'Караул',
        'Жилец',
        'Равнина',
        'Бадья',
        'Перегородка',
        'Кофейник',
        'Колба',
        'Анчоус',
        'Город',
        'Каемка',
        'Аттестат',
        'Штопор',
        'Каскадер',
        'Шампунь',
        'Автомодель',
        'Барахолка',
        'Патрон',
        'Пластилин',
        'Булавка',
        'Кухонька',
        'Крыса',
        'Закись',
        'Плотина',
        'Слово',
        'Кларнет',
        'Локатор',
        'Обертка',
        'Дот',
        'Вертеп',
        'Кокс',
        'Ломбард',
        'Ложка',
        'Землянка',
        'Гепард',
        'Пузырь',
        'Ресторан',
        'Мембрана',
        'Вермишель',
        'Амуниция',
        'Греция',
        'Капиталист',
        'Щетка',
        'Кикимора',
        'Паук',
        'Перстень',
        'Кенгуру',
        'Жасмин',
        'Бампер',
        'Ливерпуль',
        'Каталог',
        'Абажур',
        'Жаба',
        'Бастион',
        'Ломоть',
        'Зарядка',
        'Брод',
        'Звезда',
        'Космодром',
        'Заря',
        'Катерок',
        'Крылечко',
        'Бирка',
        'Клетчатка',
        'Комната',
        'Балбес',
        'Ежевика',
        'Амортизатор',
        'Банк',
        'Вампир',
        'Тара',
        'Диспансер',
        'Гитара',
        'Деньги',
        'Ель',
        'Решето',
        'Корень',
        'Электричка',
        'Дождь',
        'Скамейка',
        'Кружка',
        'Дозор',
        'Аэрозоль',
        'Растение',
        'Записка',
        'Амбал',
        'Рама',
        'Лорд',
        'Тумба',
        'Берег',
        'Лимонад',
        'Кожура',
        'Парик',
        'Заслонка',
        'Норвегия',
        'Мозг',
        'Ботинок',
        'Львица',
        'Колонна',
        'Тоннель',
        'Бобер',
        'Музей',
        'Таверна',
        'Жемчуг',
        'Бра',
        'Лоб',
        'Сапфир',
        'Киприот',
        'Паром',
        'Бык',
        'Шкаф',
        'Клеймо',
        'Автоген',
        'Лиска',
        'Пульт',
        'Лишай',
        'Сундук',
        'Окорок',
        'Биополе',
        'Балахон',
        'Губка',
        'Буханка',
        'Волга',
        'Жир',
        'Квант',
        'Единорог',
        'Обшивка',
        'Канава',
        'Икра',
        'Буфер',
        'Бублик',
        'Мускулатура',
        'Каминная',
        'Полка',
        'Враг',
        'Фломастер',
        'Варежка',
        'Пилот',
        'Церковь',
        'Плуг',
        'Мобильник',
        'Светильник',
        'Утюг',
        'Бамбук',
        'Платформа',
        'Гарнир',
        'Блестка',
        'Индюк',
        'Скафандр',
        'Плов',
        'Кат',
        'Порт',
        'Число',
        'Термит',
        'Абсорбент',
        'Жвачка',
        'Впадина',
        'Защелка',
        'Арбалет',
        'Карета',
        'Конфета',
        'Брюнет',
        'Держатель',
        'Мушкетер',
        'Линия',
        'Градусник',
        'Аварийка',
        'Гренландия',
        'Победа',
        'Казино',
        'Вершина',
        'Фонтан',
        'Акведук',
        'Архитектор',
        'Собака',
        'Композитор',
        'Ратуша',
        'Лесовоз',
        'Белка',
        'Лисичка',
        'Молекула',
        'Анаша',
        'Пенал',
        'Радиатор',
        'Указка',
        'Меч',
        'Академия',
        'Композиция',
        'Кремль',
        'Обед',
        'Колесо',
        'Копилка',
        'Альманах',
        'Перрон',
        'Мальдивы',
        'Бриджтаун',
        'Квитанция',
        'Греция',
        'Копоть',
        'Фараон',
        'Ветеринар',
        'Ватикан',
        'Сыроварение',
        'Кожура',
        'Агрономия',
        'Нагайка',
        'Злорадность',
        'Пересыхание',
        'Растяжка',
        'Фруктоза',
        'Вафельница',
        'Совокупность',
        'Отвоз',
        'Химия',
        'Затерянность',
        'Верноподданство',
        'Мотористка',
        'Олимпиец',
        'Таксист',
        'Карниз',
        'Трусость',
        'Аристократка',
        'Раскаяние',
        'Наклеивание',
        'Мнение',
        'Непримиримость',
        'Мандаринник',
        'Плутон',
        'Аспирантура',
        'Срисовывание',
        'Аварийность',
        'Холл',
        'Рейнвейн',
        'Биржа',
        'Аванпост',
        'Замыкающий',
        'Воротник',
        'Сокровище',
        'Палач',
        'Полутьма',
        'Заквашивание',
        'Камыш',
        'Аэробус',
        'Перемотчица',
        'Наводка',
        'Бронеспинка',
        'Лорд-Канцлер',
        'Патриархат',
        'Грабельщик',
        'Мексиканец',
        'Соплеменница',
        'Отступ',
        'Сирена',
        'Геркулес',
        'Шиллинг',
        'Гидрогеология',
        'Бремя',
        'Обтекаемость',
        'Давление',
        'Резидент',
        'Премия',
        'Влага',
        'Хранитель',
        'Ремарка',
        'Свеклорезка',
        'Пентод',
        'Цеж',
        'Нецензурность',
        'Предательство',
        'Похлёбка',
        'Переливка',
        'Гиповитаминоз',
        'Одиночество',
        'Завлекание',
        'Правительство',
        'Облигация',
        'Мякоть',
        'Боярышня',
        'Ненавистница',
        'Великан',
        'Медкомиссия',
        'Скромность',
        'Пассивность',
        'Рента',
        'Пояснение',
        'Отогрев',
        'Распаковка',
        'Обдувка',
        'Бравурность',
        'Оскопление',
        'Несовместимость',
        'Предназначение',
        'Бедственность',
        'Разрубание',
        'Потребность',
        'Флегматизм',
        'Натекание',
        'Топология',
        'Словоупотребление',
        'Официоз',
        'Монополизм',
        'Гранильник',
        'Магнетрон',
        'Тетрис',
        'Голод',
        'Поилка',
        'Признание',
        'Народовольчество',
        'Аккордеон',
        'Клин',
        'Кора'
    ];

    let helpIsAsked = false;
    let assistant;
    let dict = dictionary;
    let rand = dict[Math.floor(Math.random() * dict.length)];
    let com = "Прелёгкий"

    let token = "eyJhbGciOiJSUzI1NiIsInR5cCI6IkpXVCJ9.eyJzdWIiOiJhMDkxNmI5OWY4NjdkY2VkMjJhZTQ5ZDcwNmU1NWUzMmZkOTg0ZDFlNWE0YTFkOTc0ZmU2MTA4YTY4MjZkNGU0NTM5YmU5MjcwMDQyNjI5OCIsImF1ZCI6IlZQUyIsImV4cCI6MTY1ODE0MDE3MSwiaWF0IjoxNjU4MDUzNzYxLCJpc3MiOiJLRVlNQVNURVIiLCJ0eXBlIjoiQmVhcmVyIiwianRpIjoiMDk3YjI2MTItOTI4MS00M2U3LWIwMzQtZTEyZjNjOTYxMWM0Iiwic2lkIjoiOWE4MTUzYTAtMjRmMy00Zjg2LWFiMzktNTI1MjQxYWU5NGRmIn0.OORtMFeg0YQQQ1NTFSCN3gZPVWs7gyPSPGsl53p_TA-PL7rg3sCwlPl3Y-OIL7lOEOAooR7O5i_JDW_hhGK4OdSmMjOc-XYV9onFYa-XuA-gFtj3fvDCJSVYEnP9nouqhQXXcIPEk5qyDsWYN4J9t0AqFin9A-Z2WMR8dJlSCAJaxDbhCZF6LH5tR_gRtOaGdewb5SRJIdMrVhNtfyCSaoxsT7DSh_NV60G-fd0oXzGfv6fQrLEv7WU6mWlspXFOjLBbm7qYhvp8WIkgdnjacmcoibY9mwv_01Dl9T85jfIovfz8rQ7kn5FQ7dBpTXhlwzk6L8Fz1f5AL-9Ics993ffAvsxbEJ0TMMvPmBtxMMosMCTIjEHyinVEjIFS79plLmNKeaIhYLLkOoRBXuKtMSeVv3I3wII5dhOb02R3fH3yJcEKDbvkNEnvHjQv72yO_0N2YYMBbZsYs6xqwiBSEqONcpWmt07XyGwmnoNAoejLdBclkRBNBhTnoj_IoT0S4gg-7VKHSO6rVitJanSCFykPz_y-1ytZbKRgqpTCbL-V2qS-WxUvPbeW3hAWi8ftWd9rh0rRJZPvweW9cQBd_i555dfn4ByG6I-FESDosEwGek25PXqZsxtFl0lpfGmNWymbGLPy25BayrYAGyVPAX44y-hh-PnM-Bw0R8i0a3s";
// Set the name of your SmartApp for activation
    let initPhrase = 'запусти тест';
    let character = 'eva'; // default, before sber client gets state
    //$: setTheme(character);
    onMount(() =>
    {
        function getState() {return {}}

        const init = () =>
        {
            if (process.env.NODE_ENV === 'production') {return createAssistant({getState});}
            return createSmartappDebugger({token, initPhrase, getState });
        };
        assistant = init();
        assistant.on('start', () => { logger.log('SmartApp started'); });

        assistant.on('data', event =>
        {
            // Set your action or data hooks
            if (!event.type) {
                // Use invariants to prevent errors on Sber Portal
                return;
            }
            // FIXME Add event handler for closing the app and use "assistant.close()" inside it;

            if (event.type === 'character') {
                character = event.character.id;
                if (character === 'joy' || character === 'eva') {
                    setTheme('sber');
                }
            }

            if (event.type === 'smart_app_data') {
                logger.log(event.smart_app_data.type);
                if (event.smart_app_data.type === 'close_app'){
                    assistant.close();
                }
                if (event.smart_app_data.type === 'smartapp') {
                    reset();
                    rand = dict[Math.floor(Math.random() * dict.length)];
                } else if (event.smart_app_data.type === 'changeword') {
                    news();
                } else if (event.smart_app_data.type === 'changemode') {
                    toggle();
                } else if (event.smart_app_data.type === 'guessedwrong') {
                    badcount();
                    news();
                } else if (event.smart_app_data.type === 'guessedright') {
                    gcount();
                    news();
                } else if (event.smart_app_data.type === 'close') {
                    if (helpIsAsked)
                        helpIsAsked = false;
                    else
                        close();
                } else if (event.smart_app_data.type === 'help') {
                    helpIsAsked = true;
                } else if (event.smart_app_data.type === 'restart') {
                    reset();
                }
                if (event.type === 'navigation') { let word = event.navigation.command; }
                logger.log(event);
            };
        });
    });
    const call_help = () => {
        assistant.sendData({
            action: {
                action_id: 'help'
            }
        });
    }
    const changeword = () => {
        assistant.sendData({
            action: {
                action_id: 'changeword'
            }
        });
    }
    const changemode = () => {
        assistant.sendData({
            action: {
                action_id: 'changemode'
            }
        });
    }
    const restart = () => {
        assistant.sendData({
            action: {
                action_id: 'restart'
            }
        });
    }
    const guessedright = () => {
        assistant.sendData({
            action: {
                action_id: 'guessedright'
            }
        });
    }
    const guessedwrong = () => {
        assistant.sendData({
            action: {
                action_id: 'guessedwrong'
            }
        });
    }

    let game = { score: 0, best: 0,};

    const reset = () =>
    {
        game.score = 0;
        game.best = 0;
        if (visible)
        {
            visible = false;
            setTimeout(function() { rand = dict[Math.floor(Math.random() * dict.length)]; }, 500);
        }
    };
    function toggle() {
        if (!visible)
        {
            window.document.body.classList.toggle('hard-mode')
            if (com == "Прелёгкий") com = "Претрудный";
            else com = "Прелёгкий";
            rand = dict[Math.floor(Math.random() * dict.length)]
        }
        else {
            visible = false;
            setTimeout(function() {
                window.document.body.classList.toggle('hard-mode');
                if (com == "Прелёгкий") {
                    com = "Претрудный";
                }
                else {
                    com = "Прелёгкий"
                } }, 500);
            rand = dict[Math.floor(Math.random() * dict.length)]
        }
    }

    function news() {
        if (com == "Прелёгкий") {
            dict = dictionary;
            rand = dict[Math.floor(Math.random() * dict.length)]
        }
        else {
            dict = dictionary2;
            rand = dict[Math.floor(Math.random() * dict.length)]
        }
        if (visible) {
            visible = false;
            setTimeout(function() { visible = true; }, 1000);
        }
        else {

            setTimeout(function() { visible = true; }, 100);
        }
    }
    function gcount() { game.best+=1; game.score+=1; }
    function badcount() { game.best+=1; }
    let visible = false;
    function typewriter(node, { speed = 1 }) {
        const valid = (
            node.childNodes.length === 1 &&
            node.childNodes[0].nodeType === Node.TEXT_NODE
        );

        if (!valid) {
            throw new Error(`This transition only works on elements with a single text node child`);
        }
        const text = node.textContent;
        logger.log(text);
        const duration = text.length / (speed * 0.05);

        return {
            duration,
            tick: t => {
                const i = ~~(text.length * t);
                node.textContent = text.slice(0, i);
            }
        };
    }

</script>

<div class="container">

    <div class="heading">
        <h1 class="title"><a>Три «П»</a></h1>
        <div class="scores-container">
            <div class="score-container">{game.score}</div>
            <div class="best-container">{game.best}</div>
        </div>
    </div>
    <div class="game-intro">
        <button class="restart-button" on:click={() => restart()}>Заново</button>
        <button class= "help-button" on:click={() => call_help()}>Помощь</button>
        <button class = "type" on:click={() => changemode()}>Режим</button>
        <p><b> {com} </b></p>
    </div>
    <div class="game-container">
        {#if rand.length <= 17}
            {#if visible}
                <p class = "answer" transition:typewriter>{rand}</p>
            {/if}
        {/if}
        {#if rand.length >17 && rand.length <= 23 }
            {#if visible}
                <p class = "answer2" transition:typewriter>{rand}</p>
            {/if}
        {/if}
        {#if rand.length >23 && rand.length <= 29  }
            {#if visible}
                <p class = "answer5" transition:typewriter>{rand}</p>
            {/if}
        {/if}
        {#if rand.length >29 && rand.length <= 36  }
            {#if visible}
                <p class = "answer3" transition:typewriter>{rand}</p>
            {/if}
        {/if}
        {#if rand.length >36 }
            {#if visible}
                <p class = "answer4" transition:typewriter>{rand}</p>
            {/if}
        {/if}
        <div class="game-messages">
        </div>
    </div>
    <div class = "word">
        <button class = "NewWord" on:click = {() => changeword()}> Новое слово</button>
        <div class = "goodbad">
            <button class = "Good" on:click = {() => guessedright()}>Угадано</button>
            <button class = "Bad" on:click = {() => guessedwrong()}>Не угадано</button>
        </div>
        {#if helpIsAsked}
            <Help on:close="{() => helpIsAsked = false}" >
                <h2 slot="header" class="header">
                    Три «П» – правила игры:
                </h2>
                <div slot="rules" class="rules" style="color:black">
                    <b>Суть игры</b> – объяснить слово с экрана, используя слова на букву «П».<br />
                    <b>Правила игры: </b> <br />
                    1. Игроку разрешается использовать любые слова, начинающиеся на букву «П», кроме однокоренных загаданному слов.<br />
                    2. Игроку запрещается использовать слова, начинающиеся не на на букву «П». <br />
                    3. Слово считается разгаданным, если оно произнесено именно так, как оно было написано на экране.<br />
                    Приятной игры!<br />
                    <b> Правила пользования приложением:</b> <br/>
                    Кнопка «Заново» - сбрасывает набранные очки.<br/>
                    Кнопка «Режим» - меняет сложность игры. Есть два режима: «Лёгкий» и «Трудный»<br/>
                    Кнопка «Новое слово»  - выдает новое слово из того же режима. <br/>
                    Кнопка «Угадано» - увеличивает счетчик угаданных и всех слов. <br/>
                    Кнопка «Не угадано» - увеличивает счетчик всех слов. <br/>
                </div>
            </Help>
        {/if}
    </div>
</div>




<style>
    :global(body) {
        width: 99%;
        height: auto;
        font-family: clear sans, helvetica neue, Arial, sans-serif;
        background: rgb(219,233,128);
background: linear-gradient(135deg, rgba(219,233,128,1) 0%, rgba(187,204,67,1) 15%, rgba(139,151,31,1) 50%, rgba(187,204,67,1) 85%, rgba(219,233,128,1) 100%);
        font-size: 18px;

    }

    :global(body.hard-mode) .Bad, :global(body.hard-mode)  .Good, :global(body.hard-mode) .type, :global(body.hard-mode)  .NewWord, :global(body.hard-mode) .help-button, :global(body.hard-mode)  .restart-button
    {
        background: rgb(219,233,128);
background: linear-gradient(135deg, rgba(219,233,128,1) 0%, rgba(187,204,67,1) 15%, rgba(139,151,31,1) 50%, rgba(187,204,67,1) 85%, rgba(219,233,128,1) 100%);
    }

    .restart-button, .help-button, .type, .NewWord, .Bad, .Good
    {
        background: rgb(180,113,146);
        background: linear-gradient(135deg, rgba(180,113,146,1) 0%, rgba(159,87,127,1) 17%, rgba(136,72,122,1) 27%, rgba(120,65,120,1) 50%, rgba(136,72,122,1) 74%, rgba(159,87,127,1) 91%, rgba(180,113,146,1) 100%);
        color: #ffffff;
        border-color: #cccccc;
        border-width: 7px;
        border-radius: 70px;
        font-size: 100px;
        font-family: Arial Black;
    }    
    :global(body.hard-mode) {
        
        font-family: clear sans, helvetica neue, Arial, sans-serif;
        font-size: 18px;
        min-height: 30vh;
        background: rgb(180,113,146);
        background: linear-gradient(135deg, rgba(180,113,146,1) 0%, rgba(159,87,127,1) 17%, rgba(136,72,122,1) 27%, rgba(120,65,120,1) 50%, rgba(136,72,122,1) 74%, rgba(159,87,127,1) 91%, rgba(180,113,146,1) 100%);
    }
    a, p {
        font-family:'Courier New', Courier, monospace;
        -webkit-text-stroke-width: 0px;
        -webkit-text-stroke-color: black;
        color: var(--plasma-colors-text, rgba(255, 255, 255, 0.96));
    }


    .rules {
        padding-left: 2%;
    }
    .header {
        padding-left: 5%;
    }

    .restart-button:hover, .help-button:hover, .type:hover, .NewWord:hover, .Bad:hover, .Good:hover{
        box-shadow: #000000 0 0 40px;
    }
    .restart-button:focus, .help-button:focus, .type:focus, .NewWord:focus, .Bad:focus, .Good:focus{
        box-shadow: #000000 0 0 40px;
    }

    :global(body.hard-mode) .restart-button:focus,:global(body.hard-mode)  .help-button:focus,:global(body.hard-mode) .type:focus,:global(body.hard-mode) .NewWord:focus,:global(body.hard-mode) .Bad:focus,:global(body.hard-mode) .Good:focus{

        border-color: #000000;
    }
    :global(body.hard-mode) .restart-button:hover,:global(body.hard-mode) .help-button:hover,:global(body.hard-mode) .type:hover,:global(body.hard-mode) .NewWord:hover,:global(body.hard-mode) .Bad:hover,:global(body.hard-mode) .Good:hover{
        border-color: #000000;
    }



    @media screen and (max-width: 3900px) {

        .header{
            color: #061621;
            font-size: 60px;
            padding-left: 5%;
        }
        .rules {
            font-size: 60px;
            width: 2700px;
            padding-left: 5%;
        }
        body {
            position: absolute;
            owerflow-x: hidden;
            owerflow-y: hidden;
            margin: 0 auto;
        }

        :global(body) {
            font-family: clear sans, helvetica neue, Arial, sans-serif;
            font-size: 20px;
        }

        .container {
            width: auto;
            margin-top: 5%;
            margin-left: 17%;
        }

        /* heading */
        .heading:after {
            content: "";
            display: block;
            clear: both;
        }

        .heading {
            padding: 0 8px 0 0px;
        }

        .heading .title {
            font-size: 200px;
            font-weight: 700;
            margin: 0;
            display: block;
            float: left;
        }

        .heading .title a {
            left: 50%;
            text-decoration: none;
            color: white;
            text-shadow: #cccccc 0 0 20px;
            margin-left: 30px;
            font-size: 200px;
        }

        .scores-container {
            float: right;
            text-align: right;
            margin-right: 585px;
        }

        .score-container, .best-container {
            box-shadow: #cccccc 0 0 20px;
            position: relative;
            display: inline-block;
            background: #f4f4f49e;
            padding: 60px 150px;
            font-size: 100px;
            height: 100px;
            width: 100px;
            line-height: 170px;
            font-weight: 700;
            border-radius: 6px;
            color: #fff;
            margin-top: 20px;
            text-align: center;
            margin-right: 50px;
        }

        .best-container {
            margin-right: 0px;
        }

        .score-container:after, .best-container:after {
            position: absolute;
            width: 100%;
            top: 50px;
            left: 0;
            text-transform: uppercase;
            font-size: 80px;
            line-height: 0px;
            text-align: center;
            color: white;
        }

        .score-container:after {
            content: "Угадано";
        }

        .best-container:after {
            content: "Всего";
        }

        /* game-intro */
        .game-intro {
            padding: 0 8px 0 8px;
        }

        .restart-button {
            margin-right: 1%;
        }

        .help-button {
            margin-left: 40px;
        }

        .restart-button, .help-button, .type {
            cursor: pointer;
            width: 800px;
            height: 200px;
            margin-top: 40px;
            display: inline-block;
            vertical-align: middle;
            line-height: 10px;
        }
        .type {
            margin-left : 40px;
        }

        .game-intro p {
            margin-left: 1950px;
            font-size: 100px;
            margin-bottom: 15px;
            margin-top: 0;
        }

        .game-intro .type {
            margin-right: 150px;
        }

        /* game-container */
        .game-container {
            position: center;
            box-shadow: #cccccc 0 0 20px;
            padding-top: 25px;
            cursor: default;
            touch-action: none;
            background: #f4f4f49e;
            border-radius: 50px;
            width: 2600px;
            height: 400px;
            box-sizing: border-box
        }

        .answer
        {
            color: white;
            text-shadow: #cccccc 0 0 20px;
            -webkit-text-stroke: 4px #505050;
            margin-top: 150px;
            padding: 0;
            font-size: 260px;
            font-weight: 700;
            vertical-align:  center;
            text-align: center;
            line-height: 20px;
        }
        .answer2
        {
            color: white;
            text-shadow: #cccccc 0 0 20px;
            -webkit-text-stroke: 4px #505050;
            margin-top: 170px;
            padding: 0;
            font-size: 175px;
            font-weight: 700;
            vertical-align:  center;
            text-align: center;
            line-height: 20px;
        }
        .answer5
        {
            color: white;
            text-shadow: #cccccc 0 0 20px;
            -webkit-text-stroke: 4px #505050;
            margin-top: 200px;
            padding: 0;
            font-size: 140px;
            font-weight: 700;
            vertical-align:  center;
            text-align: center;
            line-height: 20px;
        }
        .answer3
        {
            color: white;
            text-shadow: #cccccc 0 0 20px;
            -webkit-text-stroke: 4px #505050;
            margin-top: 200px;
            padding: 0;
            font-size: 112px;
            font-weight: 700;
            vertical-align:  center;
            text-align: center;
            line-height: 20px;
        }
        .answer4
        {
            color: white;
            text-shadow: #cccccc 0 0 20px;
            -webkit-text-stroke: 4px #505050;
            margin-top: 220px;
            padding: 0;
            font-size: 105px;
            font-weight: 700;
            vertical-align:  center;
            text-align: center;
            line-height: 20px;
        }

        /* word */
        .word {
            position: absolute;
            display: block;
            margin-top: 2%;
            margin-left: 2%;
        }

        .NewWord {
            width: 100%;
            height: 200px;
            cursor: pointer;
            font-weight: 500;
            display: inline-block;
            vertical-align: middle;
            line-height: 10px;
        }

        .goodbad button {
            margin-bottom: 2%;
            width: 1200px;
            height: 200px;
            cursor: pointer;
            /*background: ;*/
            font-weight: 500;
            display: inline-block;
            vertical-align: middle;
            line-height: 10px;
        }

        .Bad {
            margin-left: 40px;
        }
    }
    @media screen and (max-width: 2050px) {
        .header {
            color: #061621;
            font-size:30px;
            padding-left-left: 3%;
        }

        .rules {
            width: 1500px;
            font-size: 30px;
            padding-left: 3%;
        }
        body {
            position: absolute;
            owerflow-x: hidden;
            owerflow-y: hidden;
            margin: 0 auto;
        }

        :global(body) {
            width: auto;
            height: auto;
            color: var(--plasma-colors-text, rgba(255, 255, 255, 0.96));
            min-height: 80vh;
            font-size: 18px
        }

        :global(body.hard-mode) {
            font-size: 18px;
            min-height: 30vh;
        }
        :global(body) p {
            font-size: 20px;
        }
        .restart-button, .help-button, .type, .NewWord, .Bad, .Good
        {
            border-width: 4px;
            border-radius: 35px;
            font-size: 55px;
        }
        .container {
            width: auto;
            margin-top: 3%;
            margin-left: 17%;
        }

        /* heading */
        .heading:after {
            content: "";
            display: block;
            clear: both;
        }

        .heading {
            padding: 0 8px 0 0px;
        }

        .heading .title {
            font-size: 60px;
            font-weight: 700;
            margin: 0;
            display: block;
            float: left;
        }

        .heading .title a {
            pointer-events: none;
            left: 50%;
            text-decoration: none;
            color: white;
            text-shadow: #cccccc 0 0 20px;
            margin-left: 30px;
            font-size: 90px;
        }

        .scores-container {
            float: right;
            text-align: right;
            margin-right: 160px;
            margin-top: -25px;
            margin-bottom: 25px;
        }

        .score-container, .best-container {
            box-shadow: #cccccc 0 0 20px;
            position: relative;
            display: inline-block;
            background: #f4f4f49e;
            padding: 15px 25px;
            font-size: 50px;
            height: 80px;
            width: 100px;
            line-height: 100px;
            font-weight: 700;
            border-radius: 6px;
            color: #fff;
            margin-top: 20px;
            text-align: center;
            margin-right: 25px;
        }

        .best-container {
            margin-right: 220px;
        }

        .score-container:after, .best-container:after {
            position: absolute;
            width: 100%;
            top: 15px;
            left: 0;
            text-transform: uppercase;
            font-size: 25px;
            line-height: 15px;
            text-align: center;
            color: white;
        }

        .score-container:after
        {
            content: "Угадано";
        }

        .best-container:after
        {
            content: "Всего";
        }

        /* game-intro */
        .game-intro {
            padding: 0 8px 0 12px;
        }

        .restart-button {
            margin-left: 0px;
        }

        .help-button {
            margin-left: 0px;
        }

        .restart-button, .help-button, .type{
            width: 395px;
            height: 100px;
            margin-top: 20px;
            font-weight: 500;
            display: inline-block;
            vertical-align: middle;
            line-height: 10px;
        }
        .help-button{
            padding: 0;
        }
        .type {
            margin-left: 15px;
        }

        .game-intro p {
            margin-left: 940px;
            font-size: 50px;
            margin-bottom: 15px;
            margin-top: 0;
        }

        .game-intro .type {
            margin-right: 150px;
        }

        /* game-container */
        .game-container {
            position: center;
            box-shadow: #cccccc 0 0 20px;
            padding-top: 25px;
            cursor: default;
            touch-action: none;
            background: #f4f4f49e;
            border-radius: 35px;
            width: 1260px;
            height: 200px;
            box-sizing: border-box;
            margin-bottom: 25px;
        }

        .answer {
            color: white;
            text-shadow: #cccccc 0 0 20px;
            -webkit-text-stroke: 2px #505050;
            margin-top: 60px;
            padding: 0;
            font-size: 100px;
            font-weight: 700;
            vertical-align:  center;
            text-align: center;
            line-height: 20px;
        }
        .answer2
        {
            color: white;
            text-shadow: #cccccc 0 0 20px;
            -webkit-text-stroke: 2px #505050;
            margin-top: 60px;
            padding: 0;
            font-size: 80px;
            font-weight: 700;
            vertical-align:  center;
            text-align: center;
            line-height: 20px;
        }
        .answer5
        {
            color: white;
            text-shadow: #cccccc 0 0 20px;
            -webkit-text-stroke: 2px #505050;
            margin-top: 30px;
            padding: 0;
            font-size: 70px;
            font-weight: 700;
            vertical-align:  center;
            text-align: center;
            line-height: 20px;
        }
        .answer3
        {
            color: white;
            text-shadow: #cccccc 0 0 20px;
            -webkit-text-stroke: 2px #505050;
            margin-top: 60px;
            padding: 0;
            font-size: 54px;
            font-weight: 700;
            vertical-align:  center;
            text-align: center;
            line-height: 20px;
        }
        .answer4
        {
            color: white;
            text-shadow: #cccccc 0 0 20px;
            -webkit-text-stroke: 2px #505050;
            margin-top: 60px;
            padding: 0;
            font-size: 48px;
            font-weight: 700;
            vertical-align:  center;
            text-align: center;
            line-height: 20px;
        }

        /* word */
        .word {
            position: absolute;
            display: block;
            margin-top: 1.5%;
            margin-left: 1%;
        }

        .NewWord {
            width: 100%;
            height: 100px;
            cursor: pointer;
            font-weight: 500;
            border-color: #cccccc;
            display: inline-block;
            vertical-align: middle;
            line-height: 10px;

        }

        .goodbad button {
            margin-bottom: 1.5%;
            width: 600px;
            height: 100px;
            cursor: pointer;
            /*background: ;*/
            font-weight: 500;
            display: inline-block;
            vertical-align: middle;
            line-height: 10px;
        }

        .Bad {
            margin-left: 10px;
        }

    }
    @media screen and (max-width: 1300px) {
        .header {
            font-size: 19px;
            color: #061621;
        }
        .rules {
            font-size: 19px;
            width: 900px;
        }

        body {
            position: absolute;
            owerflow-x: hidden;
            owerflow-y: hidden;
            margin: 0 auto;
        }

        :global(body) {
            width: auto;
            height: auto;
            color: white;
            /*background: linear-gradient(to top left, powderblue 20%, pink 100%);*/
            font-family: clear sans, helvetica neue, Arial, sans-serif;
            font-size: 18px
        }

        :global(body.hard-mode) {
            font-family: clear sans, helvetica neue, Arial, sans-serif;
            font-size: 18px;
            min-height: 30vh;
            /*background: linear-gradient(to top right, powderblue, pink);*/

        }

        :global(body) p {
            font-family: clear sans, helvetica neue, Arial, sans-serif;
            font-size: 20px;
        }
        .restart-button, .help-button, .type, .NewWord, .Bad, .Good
        {
            border-width: 2px;
            border-radius: 25px;
            font-size: 35px;
            height: 70px;
        }

        .container {
            width: auto;
            margin-top: 1%;
            margin-left: 17%;
        }

        /* heading */
        .heading:after {
            content: "";
            display: block;
            clear: both;
        }

        .heading {
            padding: 0 8px 0 25px;
        }

        .heading .title {
            font-size: 60px;
            font-weight: 700;
            margin: 0;
            display: block;
            float: left;
        }

        .heading .title a {
            pointer-events: none;
            left: 50%;
            text-decoration: none;
            color: white;
            text-shadow: #cccccc 0 0 20px;
            margin-left: 30px;
            font-size: 50px;
        }

        .scores-container {
            float: right;
            text-align: right;
            margin-bottom: 10px;
            margin-top: 5px;
        }

        .score-container, .best-container {
            box-shadow: #cccccc 0 0 20px;
            position: relative;
            display: inline-block;
            background: #f4f4f49e;
            padding: 15px 25px;
            font-size: 25px;
            height: 30px;
            width: 50px;
            line-height: 47px;
            font-weight: 700;
            border-radius: 6px;
            color: #fff;
            margin-top: 20px;
            text-align: center;
        }

        .best-container {
            margin-right: 220px;
        }

        .score-container:after, .best-container:after {
            position: absolute;
            width: 100%;
            top: 10px;
            left: 0;
            text-transform: uppercase;
            font-size: 20px;
            line-height: 10px;
            text-align: center;
            color: white;
        }

        .score-container:after {
            content: "Угадано";
        }

        .best-container:after {
            content: "Всего";
        }

        /* game-intro */
        .game-intro {
            padding: 0 8px 0 8px;
        }

        .restart-button {
            margin-left: 30px;
        }

        .help-button {
            margin-left: 10px;
        }

        .restart-button, .help-button, .type {
            width: 246px;
            margin-top: 20px;
            display: inline-block;
            vertical-align: middle;
            line-height: 10px;
        }

        .game-intro p {
            margin-left: 665px;
            font-size: 30px;
            margin-bottom: 15px;
            margin-top: 0;
        }

        .game-intro .type {
            margin-right: 150px;
        }

        /* game-container */
        .game-container {
            position: center;
            box-shadow: #cccccc 0 0 20px;
            padding-top: 25px;
            cursor: default;
            touch-action: none;
            background: #f4f4f49e;
            border-radius: 25px;
            width: 860px;
            height: 100px;
            box-sizing: border-box
        }

        .answer {
            color: white;
            text-shadow: #cccccc 0 0 20px;
            -webkit-text-stroke: 2px #505050;
            margin-top: 10px;
            padding: 0;
            font-size: 80px;
            font-weight: 700;
            vertical-align:  center;
            text-align: center;
            line-height: 20px;
        }
        .answer2
        {
            color: white;
            text-shadow: #cccccc 0 0 20px;
            -webkit-text-stroke: 2px #505050;
            margin-top: 10px;
            padding: 0;
            font-size: 60px;
            font-weight: 700;
            vertical-align:  center;
            text-align: center;
            line-height: 20px;
        }
        .answer5
        {
            color: white;
            text-shadow: #cccccc 0 0 20px;
            -webkit-text-stroke: 2px #505050;
            margin-top: 10px;
            padding: 0;
            font-size: 50px;
            font-weight: 700;
            vertical-align:  center;
            text-align: center;
            line-height: 20px;
        }
        .answer3
        {
            color: white;
            text-shadow: #cccccc 0 0 20px;
            -webkit-text-stroke: 2px #505050;
            margin-top: 10px;
            padding: 0;
            font-size: 44px;
            font-weight: 700;
            vertical-align:  center;
            text-align: center;
            line-height: 20px;
        }
        .answer4
        {
            color: white;
            text-shadow: #cccccc 0 0 20px;
            -webkit-text-stroke: 2px #505050;
            margin-top: 10px;
            padding: 0;
            font-size: 38px;
            font-weight: 700;
            vertical-align:  center;
            text-align: center;
            line-height: 20px;
        }

        /* word */
        .word {
            position: absolute;
            display: block;
            margin-top: 2%;
            margin-left: 2%;
        }
        .NewWord {
            width: 100%;
            cursor: pointer;
            display: inline-block;
            vertical-align: middle;
            line-height: 10px;

        }

        .goodbad button {
            margin-bottom: 2%;
            width: 395px;
            cursor: pointer;
            /*background: ;*/
            display: inline-block;
            vertical-align: middle;
            line-height: 10px;
            height: 70px;
        }

        .Bad {
            margin-left: 10px;
        }
    }

    @media screen and (max-width: 1000px) and (max-height: 1400px) {
        .header {
            font-size: 19px;
            color: #061621;
        }
        .rules {
            text-align: left;
            font-size: 15px;
            width: 90%
        }

        body {
            position: absolute;
            owerflow-x: hidden;
            owerflow-y: hidden;
            margin: 0 auto;
        }

        :global(body) {
            width: auto;
            height: auto;
            color: white;
            /*background: linear-gradient(to top left, powderblue 20%, pink 100%);*/
            font-family: clear sans, helvetica neue, Arial, sans-serif;
            font-size: 18px
        }

        :global(body.hard-mode) {
            font-family: clear sans, helvetica neue, Arial, sans-serif;
            font-size: 18px;
            min-height: 30vh;
            /*background: linear-gradient(to top right, powderblue, pink);*/

        }

        :global(body) p {
            font-family: clear sans, helvetica neue, Arial, sans-serif;
            font-size: 20px;
        }
        .restart-button, .help-button, .type, .NewWord, .Bad, .Good
        {
            border-width: 2px;
            border-radius: 25px;
            font-size: 35px;
            height: 70px;
        }

        .container {
            width: auto;
            margin-top: 1%;
            margin-left: 1%;
            margin-right: 1%;
        }

        /* heading */
        .heading:after {
            content: "";
            display: block;
            clear: both;
        }

        .heading {
            padding: 0 8px 0 8px;
            text-align: center;
        }

        .heading .title {
            text-align: center;
            font-size: 60px;
            font-weight: 700;
            margin: 0;
            display: block;
            float: left;
            width: 100%;
        }

        .heading .title a {
            pointer-events: none;
            left: 50%;
            text-decoration: none;
            color: white;
            text-shadow: #cccccc 0 0 20px;
            font-size: 100%;
        }

        .scores-container {
            float: inherit;
            margin-right: 10%;
        }

        .score-container, .best-container {
            box-shadow: #cccccc 0 0 20px;
            position: relative;
            display: inline-block;
            background: #f4f4f49e;
            padding: 15px 5%;
            font-size: 25px;
            height: 30px;
            width: 7%;
            line-height: 47px;
            font-weight: 700;
            border-radius: 6px;
            color: #fff;
            margin-top: 20px;
            text-align: center;
        }

        .best-container {
            margin-right: 28%;
        }

        .score-container:after, .best-container:after {
            position: absolute;
            width: 100%;
            top: 10px;
            left: 0;
            text-transform: uppercase;
            font-size: 20px;
            line-height: 10px;
            text-align: center;
            color: white;
        }

        .score-container:after {
            content: "Угадано";
        }

        .best-container:after {
            content: "Всего";
        }

        /* game-intro */
        .game-intro {
            padding: 0 8px 0 8px;
            text-align: center;
        }

        .restart-button {
            margin-left: 0px;
        }

        .help-button {
            margin-left: 0px;
        }

        .restart-button, .help-button {
            width: 48%;
            margin-top: 20px;
            display: inline-block;
            vertical-align: middle;
            line-height: 10px;
        }

        .type {
            margin-left: 1%;
            margin-right: 1%;
            cursor: pointer;
            width: 98%;
            margin-top: 20px;
            font-weight: 500;
            display: inline-block;
            vertical-align: middle;
            line-height: 10px;
        }

        .game-intro p {
            margin-left: 0px;
            font-size: 30px;
            margin-bottom: 2%;
            margin-top: 0;
        }

        .game-intro .type {
            margin-right: 0px;
        }

        /* game-container */
        .game-container {
            position: center;
            box-shadow: #cccccc 0 0 20px;
            padding-top: 25px;
            cursor: default;
            touch-action: none;
            background: #f4f4f49e;
            border-radius: 25px;
            width: 100%;
            height: 100px;
            box-sizing: border-box
        }

        .answer {
            color: white;
            text-shadow: #cccccc 0 0 20px;
            -webkit-text-stroke: 2px #505050;
            margin-top: 10px;
            padding: 0;
            font-size: 80px;
            font-weight: 700;
            vertical-align:  center;
            text-align: center;
            line-height: 20px;
        }
        .answer2
        {
            color: white;
            text-shadow: #cccccc 0 0 20px;
            -webkit-text-stroke: 2px #505050;
            margin-top: 10px;
            padding: 0;
            font-size: 60px;
            font-weight: 700;
            vertical-align:  center;
            text-align: center;
            line-height: 20px;
        }
        .answer5
        {
            color: white;
            text-shadow: #cccccc 0 0 20px;
            -webkit-text-stroke: 2px #505050;
            margin-top: 10px;
            padding: 0;
            font-size: 50px;
            font-weight: 700;
            vertical-align:  center;
            text-align: center;
            line-height: 20px;
        }
        .answer3
        {
            color: white;
            text-shadow: #cccccc 0 0 20px;
            -webkit-text-stroke: 2px #505050;
            margin-top: 10px;
            padding: 0;
            font-size: 44px;
            font-weight: 700;
            vertical-align:  center;
            text-align: center;
            line-height: 20px;
        }
        .answer4
        {
            color: white;
            text-shadow: #cccccc 0 0 20px;
            -webkit-text-stroke: 2px #505050;
            margin-top: 10px;
            padding: 0;
            font-size: 38px;
            font-weight: 700;
            vertical-align:  center;
            text-align: center;
            line-height: 20px;
        }

        /* word */
        .word {
            position: absolute;
            display: block;
            margin-top: 2%;
            text-align: center;
            width: 95%;
        }
        .NewWord {
            width: 98%;
            cursor: pointer;
            display: inline-block;
            vertical-align: middle;
            line-height: 10px;

        }

        .goodbad button {
            margin-bottom: 2%;
            width: 98%;
            cursor: pointer;
            /*background: ;*/
            display: inline-block;
            vertical-align: middle;
            line-height: 10px;
            height: 70px;
        }

        .Bad {
            margin-left: 1%;
        }
    }

    @media screen and (max-width: 500px) and (max-height: 1000px) {
        .header {
            font-size: 16px;
            color: #061621;
        }
        .rules {
            font-size: 11px;
            width: 90%;
        }

        body {
            position: absolute;
            owerflow-x: hidden;
            owerflow-y: hidden;
            margin: 0 auto;
        }

        :global(body) {
            width: auto;
            height: auto;
            color: white;
            /*background: linear-gradient(to top left, powderblue 20%, pink 100%);*/
            font-family: clear sans, helvetica neue, Arial, sans-serif;
            font-size: 18px
        }

        :global(body.hard-mode) {
            font-family: clear sans, helvetica neue, Arial, sans-serif;
            font-size: 18px;
            min-height: 30vh;
            /*background: linear-gradient(to top right, powderblue, pink);*/

        }

        :global(body) p {
            font-family: clear sans, helvetica neue, Arial, sans-serif;
            font-size: 20px;
        }
        .restart-button, .help-button, .type, .NewWord, .Bad, .Good
        {
            border-width: 2px;
            border-radius: 25px;
            font-size: 25px;
            height: 50px;
        }

        .container {
            width: auto;
            margin-top: 1%;
            margin-left: 1%;
            margin-right: 1%;
        }

        /* heading */
        .heading:after {
            content: "";
            display: block;
            clear: both;
        }

        .heading {
            padding: 0 8px 0 8px;
            text-align: center;
        }

        .heading .title {
            text-align: center;
            font-size: 28px;
            font-weight: 700;
            margin: 0;
            display: block;
            float: left;
            width: 100%;
        }

        .heading .title a {
            pointer-events: none;
            left: 50%;
            text-decoration: none;
            color: white;
            text-shadow: #cccccc 0 0 20px;
            font-size: 100%;
            margin-left: 0px;
        }

        .scores-container {
            float: inherit;
            margin-right: 10%;
        }

        .score-container, .best-container {
            box-shadow: #cccccc 0 0 20px;
            position: relative;
            display: inline-block;
            background: #f4f4f49e;
            padding: 15px 5%;
            font-size: 25px;
            height: 30px;
            width: 7%;
            line-height: 47px;
            font-weight: 700;
            border-radius: 6px;
            color: #fff;
            margin-top: 10px;
            text-align: center;
            margin-right: 0px;
        }

        .best-container {
            margin-right: 28%;
        }

        .score-container:after, .best-container:after {
            position: absolute;
            width: 100%;
            top: 10px;
            left: 0;
            text-transform: uppercase;
            font-size: 10px;
            line-height: 10px;
            text-align: center;
            color: white;
            margin-right: 0px;
        }

        .score-container:after {
            content: "Угадано";
        }

        .best-container:after {
            content: "Всего";
        }

        /* game-intro */
        .game-intro {
            padding: 0 8px 0 8px;
            text-align: center;
        }

        .restart-button {
            margin-left: 0px;
        }

        .help-button {
            margin-left: 0px;
        }

        .restart-button, .help-button {
            width: 48%;
            margin-top: 20px;
            display: inline-block;
            vertical-align: middle;
            line-height: 10px;
        }

        .type {
            margin-left: 1%;
            margin-right: 1%;
            cursor: pointer;
            width: 98%;
            margin-top: 0px;
            font-weight: 500;
            display: inline-block;
            vertical-align: middle;
            line-height: 10px;
        }

        .game-intro p {
            margin-left: 0px;
            font-size: 25px;
            margin-bottom: 2%;
            margin-top: 0;
        }

        .game-intro .type {
            margin-right: 0px;
        }

        /* game-container */
        .game-container {
            position: center;
            box-shadow: #cccccc 0 0 20px;
            padding-top: 25px;
            cursor: default;
            touch-action: none;
            background: #f4f4f49e;
            border-radius: 25px;
            width: 100%;
            height: 100px;
            box-sizing: border-box;
            margin-bottom: 5px;
        }

        .answer {
            color: white;
            text-shadow: #cccccc 0 0 20px;
            -webkit-text-stroke: 2px #505050;
            margin-top: 10px;
            padding: 0;
            font-size: 40px;
            font-weight: 700;
            vertical-align:  center;
            text-align: center;
            line-height: 20px;
        }
        .answer2
        {
            color: white;
            text-shadow: #cccccc 0 0 20px;
            -webkit-text-stroke: 2px #505050;
            margin-top: 10px;
            padding: 0;
            font-size: 30px;
            font-weight: 700;
            vertical-align:  center;
            text-align: center;
            line-height: 20px;
        }
        .answer5
        {
            color: white;
            text-shadow: #cccccc 0 0 20px;
            -webkit-text-stroke: 2px #505050;
            margin-top: 10px;
            padding: 0;
            font-size: 20px;
            font-weight: 700;
            vertical-align:  center;
            text-align: center;
            line-height: 20px;
        }
        .answer3
        {
            color: white;
            text-shadow: #cccccc 0 0 20px;
            -webkit-text-stroke: 2px #505050;
            margin-top: 10px;
            padding: 0;
            font-size: 15px;
            font-weight: 700;
            vertical-align:  center;
            text-align: center;
            line-height: 20px;
        }
        .answer4
        {
            color: white;
            text-shadow: #cccccc 0 0 20px;
            -webkit-text-stroke: 2px #505050;
            margin-top: 10px;
            padding: 0;
            font-size: 10px;
            font-weight: 700;
            vertical-align:  center;
            text-align: center;
            line-height: 20px;
        }

        /* word */
        .word {
            position: absolute;
            display: block;
            margin-top: 2%;
            text-align: center;
            width: 95%;
        }
        .NewWord {
            width: 98%;
            cursor: pointer;
            display: inline-block;
            vertical-align: middle;
            line-height: 10px;

        }

        .goodbad button {
            margin-bottom: 2%;
            width: 98%;
            cursor: pointer;
            /*background: ;*/
            display: inline-block;
            vertical-align: middle;
            line-height: 10px;
            height: 50px;
        }

        .Bad {
            margin-left: 1%;
        }
    }
    @media screen and (max-width: 400px) and (max-height: 700px) {
        .header {
            font-size: 15px;
            color: #061621;
        }
        .rules {
            font-size: 10px;
            width: 90%;
        }

        body {
            position: absolute;
            owerflow-x: hidden;
            owerflow-y: hidden;
            margin: 0 auto;
        }

        :global(body) {
            width: auto;
            height: auto;
            color: white;
            /*background: linear-gradient(to top left, powderblue 20%, pink 100%);*/
            font-family: clear sans, helvetica neue, Arial, sans-serif;
            font-size: 16px
        }

        :global(body.hard-mode) {
            font-family: clear sans, helvetica neue, Arial, sans-serif;
            font-size: 16px;
            min-height: 30vh;
            /*background: linear-gradient(to top right, powderblue, pink);*/

        }

        :global(body) p {
            font-family: clear sans, helvetica neue, Arial, sans-serif;
            font-size: 20px;
        }
        .restart-button, .help-button, .type, .NewWord, .Bad, .Good
        {
            border-width: 2px;
            border-radius: 25px;
            font-size: 20px;
            height: 40px;
        }

        .container {
            width: auto;
            margin-top: 1%;
            margin-left: 1%;
            margin-right: 1%;
        }

        /* heading */
        .heading:after {
            content: "";
            display: block;
            clear: both;
        }

        .heading {
            padding: 0 8px 0 8px;
            text-align: center;
        }

        .heading .title {
            text-align: center;
            font-size: 30px;
            font-weight: 700;
            margin: 0;
            display: block;
            float: left;
            width: 100%;
        }

        .heading .title a {
            pointer-events: none;
            margin-left: 0px;
            left: 50%;
            text-decoration: none;
            color: white;
            text-shadow: #cccccc 0 0 20px;
            font-size: 100%;
            margin-left: 0px;
        }

        .scores-container {
            float: inherit;
            margin-right: 10%;
        }

        .score-container, .best-container {
            box-shadow: #cccccc 0 0 20px;
            position: relative;
            display: inline-block;
            background: #f4f4f49e;
            padding: 10px 5%;
            font-size: 25px;
            height: 30px;
            width: 7%;
            line-height: 47px;
            font-weight: 700;
            border-radius: 6px;
            color: #fff;
            margin-top: 10px;
            text-align: center;
            margin-right: 0px;
        }

        .best-container {
            margin-right: 28%;
        }

        .score-container:after, .best-container:after {
            position: absolute;
            width: 100%;
            top: 10px;
            left: 0;
            text-transform: uppercase;
            font-size: 10px;
            line-height: 10px;
            text-align: center;
            color: white;
            margin-right: 0px;
        }

        .score-container:after {
            content: "Угадано";
        }

        .best-container:after {
            content: "Всего";
        }

        /* game-intro */
        .game-intro {
            padding: 0 8px 0 8px;
            text-align: center;
        }

        .restart-button {
            margin-left: 0px;
        }

        .help-button {
            margin-left: 0px;
        }

        .restart-button, .help-button {
            width: 48%;
            margin-top: 10px;
            margin-bottom: 5px;
            display: inline-block;
            vertical-align: middle;
            line-height: 10px;
        }

        .type {
            margin-left: 1%;
            margin-right: 1%;
            cursor: pointer;
            width: 98%;
            margin-top: 0px;
            font-weight: 500;
            display: inline-block;
            vertical-align: middle;
            line-height: 10px;
            margin-bottom: 5px;
        }

        .game-intro p {
            margin-left: 0px;
            font-size: 20px;
            margin-bottom: 2%;
            margin-top: 0px;
            margin-bottom: 5px;
        }

        .game-intro .type {
            margin-right: 0px;
        }

        /* game-container */
        .game-container {
            position: center;
            box-shadow: #cccccc 0 0 20px;
            padding-top: 25px;
            cursor: default;
            touch-action: none;
            background: #f4f4f49e;
            border-radius: 25px;
            width: 100%;
            height: 100px;
            box-sizing: border-box;
            margin-bottom: 5px;
        }

        .answer {
            color: white;
            text-shadow: #cccccc 0 0 20px;
            -webkit-text-stroke: 2px #505050;
            margin-top: 10px;
            padding: 0;
            font-size: 35px;
            font-weight: 700;
            vertical-align:  center;
            text-align: center;
            line-height: 20px;
        }
        .answer2
        {
            color: white;
            text-shadow: #cccccc 0 0 20px;
            -webkit-text-stroke: 2px #505050;
            margin-top: 10px;
            padding: 0;
            font-size: 25px;
            font-weight: 700;
            vertical-align:  center;
            text-align: center;
            line-height: 20px;
        }
        .answer5
        {
            color: white;
            text-shadow: #cccccc 0 0 20px;
            -webkit-text-stroke: 2px #505050;
            margin-top: 10px;
            padding: 0;
            font-size: 16px;
            font-weight: 700;
            vertical-align:  center;
            text-align: center;
            line-height: 20px;
        }
        .answer3
        {
            color: white;
            text-shadow: #cccccc 0 0 20px;
            -webkit-text-stroke: 2px #505050;
            margin-top: 10px;
            padding: 0;
            font-size: 12px;
            font-weight: 700;
            vertical-align:  center;
            text-align: center;
            line-height: 20px;
        }
        .answer4
        {
            color: white;
            text-shadow: #cccccc 0 0 20px;
            -webkit-text-stroke: 2px #505050;
            margin-top: 10px;
            padding: 0;
            font-size: 8px;
            font-weight: 700;
            vertical-align:  center;
            text-align: center;
            line-height: 20px;
        }

        /* word */
        .word {
            position: absolute;
            display: block;
            margin-top: 2%;
            text-align: center;
            width: 95%;
        }
        .NewWord {
            width: 98%;
            cursor: pointer;
            display: inline-block;
            vertical-align: middle;
            line-height: 10px;

        }

        .goodbad button {
            margin-bottom: 2%;
            width: 98%;
            cursor: pointer;
            /*background: ;*/
            display: inline-block;
            vertical-align: middle;
            line-height: 10px;
            height: 50px;
        }

        .Bad {
            margin-left: 1%;
        }
    }

</style>